# ==========================
# Цель: Запуск сервера разработки
# Описание: Эта цель запускает Django-сервер с помощью uv.
# ==========================
run:
	uv run manage.py runserver

# ==========================
# Цель: Проверка качества кода (Линтинг и форматирование)
# Описание: Выполняет все хуки pre-commit для обеспечения чистого кода.
# ==========================
lint:
	uv run pre-commit run --all-files

# ==========================
# Цель: Настройка базы данных и миграции
# Описание: Создает суперпользователя и выполняет миграцию БД.
# ==========================
setup_db:
	uv run manage.py migrate
	uv run manage.py createsuperuser

# ==========================
# Цель: Тестирование
# Описание: Запускает все модульные тесты проекта.
# ==========================
test:
	uv run manage.py test
